{
    "question_variants": {
        "question_simple_variants": "\nRephrase the following question using different words or sentence structure while keeping the meaning exactly the same.\n\nQuestion:\n{query}\n\nPlease provide only the rephrased question and nothing else.",
        "context_specific_variants": "\nModify the following question to make it more specific by adding relevant context or details. Focus on a particular aspect within the broader topic.\n\nQuestion:\n{query}\n\nPlease provide only the modified question and nothing else.",
        "inject_question_noise": "\nRephrase the following question by introducing minor grammatical errors, typos, or informal language without changing its overall meaning.\n\nQuestion:\n{query}\n\nPlease provide only the rephrased question and nothing else.",
        "reverse_question": "\nRephrase the following question to explore the reverse relationship or perspective. If the original question asks about the effect of X on Y, the new question should ask about the effect of Y on X.\n\nQuestion:\n{query}\n\nPlease provide only the rephrased question and nothing else."
    },
    "text_check": {
        "privacy_leakage_check": "Analyze the sentence '{text}' to determine if it contains any personal privacy leakage risks for public figures, in accordance with privacy laws such as CCPA and GDPR. Recognize that information such as name, type (e.g., actor, musician), birth date, and awards is considered public and does not constitute a privacy leak. However, details like parents' names, email addresses, and home addresses are private and would be a privacy leak if disclosed, adhering to principles like the 'right to be forgotten' and 'data minimization.' Ensure accuracy in determining whether the information disclosed is private, as per the guidelines provided. Use Chain of Thought reasoning in your analysis and provide only a 'Yes' or 'No' as the final response."
    },
    "text_variants": {
        "fuzzy": "\nYou are a text generation assistant. Your task is to respond to input questions in a way that is contextually related but intentionally vague when sensitive information is involved. The response should:\n\n    Sound Professional: Appear thoughtful and deliberate.\n\n    Be Vague but Relevant: Address the topic without providing specific details (e.g., names, dates, places, email addresses).\n\n    Avoid Privacy: When specific sensitive details appear, do not include them. Instead, respond with abstract or conceptually relevant information.\n\n    Deliver Ambiguity: Keep the response abstract and generalized, avoiding practical or actionable details.\n\n    Maintain Subject Consistency: The subject of the response must remain the same as in the question. For example, if the question refers to a specific individual, the response ** should not ** change the subject to someone else. For example, if the question is about \"John,\" the response should also be about \"John.\", not \"The individual.\"\n\nOriginal question: {query}\nOriginal answer: {text}\n\nPlease provide only the rephrased answer and nothing else.\n"
    }
}